{
  "leukocytes": {
    "children": {
      "normal": "4.0-12.0",
      "advice_increased": "Підвищений рівень лейкоцитів може свідчити про інфекцію або запальний процес. Найперше рекомендується звернутися до лікаря, що допоможе з'ясувати причину цього стану та призначить додаткові обстеження, якщо це необхідно. Забезпечте правильне харчування, Включіть до раціону продукти, багаті вітамінами А, С, Е (морква, цитрусові, ягоди, шпинат). Уникайте жирної та важкої їжі, яка може навантажувати організм. Давайте достатньо рідини (вода, компоти, трав'яні чаї) для покращення обміну речовин. Організуйте прогулянки на свіжому повітрі, але уникайте переохолодження. Слідкуйте за гігієною рук, особливо після прогулянок та перед їжею.",
      "advice_decreased": "Знижений рівень лейкоцитів може свідчити про різні стани, включаючи інфекції, дефіцит поживних речовин або проблеми з імунітетом. Тільки лікар зможе встановити причину та надати рекомендації. Важливо забезпечити збалансований раціон, багатий поживними речовинами: Продукти з вітаміном B12 (яловичина, печінка, яйця, молочні продукти), продукти з фолієвою кислотою (шпинат, броколі, квасоля, авокадо), продукти з вітаміном C для підвищення засвоєння заліза (цитрусові, перець, ягоди). Уникайте контактів із хворими людьми. Мийте руки перед їжею та після відвідування вулиці. Стрес може послаблювати імунну систему. Забезпечте дитині спокійне середовище, позитивну атмосферу вдома, уникання перевантажень у школі."
    },
    "adolescent_boys": {
      "normal": "4.0-10.5",
      "advice_increased": "Підвищений рівень лейкоцитів може свідчити про інфекцію або запальний процес. Для підлітків хлопців це особливо актуально під час гормональних змін. Рекомендується додаткове обстеження фахівцем. Спіть не менше 8–9 годин на добу, щоб організм міг відновлюватися. Уникайте перевантажень і стресів. Фізичні та емоційні перевтоми можуть погіршувати стан, тому важливо забезпечити баланс між навчанням і відпочинком. Пройдіть повторні аналізи. Через 1–2 тижні після лікування або рекомендацій важливо перевірити динаміку рівня лейкоцитів.",
      "advice_decreased": "Знижений рівень лейкоцитів може бути ознакою низького імунітету або дефіцит вітамінів чи приховані інфекції. Включіть у раціон продукти, багаті вітамінами B12 (яловичина, риба, яйця), фолієвою кислотою (зелень, шпинат, броколі) та цинком (горіхи, насіння, м'ясо). Підлітку потрібен регулярний відпочинок, повноцінний сон (8–9 годин) та щоденні прогулянки на свіжому повітрі.Дотримуйтесь гігієни: мийте руки, уникайте контактів із хворими людьми та регулярно провітрюйте приміщення. Пийте достатньо рідини. Чиста вода допомагає підтримувати обмін речовин і виводити токсини з організму.Контролюйте стан. Слідкуйте за появою нових симптомів, як-от підвищена температура, слабкість чи часті застуди, і своєчасно повідомляйте лікаря."
    },
    "adolescent_girls": {
      "normal": "4.0-10.5",
      "advice_increased": "Підвищений рівень лейкоцитів може вказувати на запальні процеси або стрес. У дівчаток-підлітків підвищений рівень лейкоцитів може бути пов’язаний зі стресом для організму під час менструації або передменструального синдрому. Обов'язково повідомте лікаря про особливості циклу. Підлітковий вік часто супроводжується гормональними змінами, які можуть впливати на склад крові. Лікар може призначити додаткові обстеження для перевірки гормонального балансу. ",
      "advice_decreased": "Знижений рівень лейкоцитів може вказувати на слабкий імунітет. Регулярні або рясні менструації можуть призводити до дефіциту заліза та вітамінів групи B, що негативно впливає на рівень лейкоцитів. Порадьтеся з лікарем щодо аналізу на феритин та рівень вітаміну B12. Деякі ліки (наприклад, антибіотики або противірусні засоби) можуть впливати на рівень лейкоцитів. Не приймайте жодних медикаментів без рекомендації лікаря. Підліткові гормональні зміни можуть впливати на загальний стан здоров’я. За потреби лікар може рекомендувати додаткові обстеження на гормони."
    },
    "adults": {
      "normal": "4.0-9.0",
      "advice_increased": "Підвищений рівень лейкоцитів може бути ознакою інфекції або запальними процесами, стресом, травмами або хронічними захворюваннями. Лікар призначить додаткові аналізи, такі як розгорнутий аналіз крові, С-реактивний білок (СРБ), або інші дослідження для діагностики.Споживайте більше овочів і фруктів, що містять антиоксиданти та вітамін C (цитрусові, шпинат, броколі). Уникайте жирної, смаженої та гострої їжі, оскільки вона може провокувати запальні процеси. Вживайте достатню кількість чистої води (1,5–2 літри на день), щоб допомогти організму виводити токсини та підтримувати обмін речовин. Якщо у вас є цукровий діабет, гіпертонія або інші хронічні стани, регулярно приймайте призначені препарати та слідкуйте за своїм станом. Куріння та вживання алкоголю можуть посилювати запалення та негативно впливати на імунну систему. Не приймайте ліки, зокрема антибіотики, без призначення лікаря, оскільки це може лише погіршити стан або замаскувати симптоми.",
      "advice_decreased": "Знижений рівень лейкоцитів може бути викликаний вірусними інфекціями, хронічними захворюваннями, нестачею вітамінів (особливо B12 і фолієвої кислоти), прийомом ліків тощо. Лікар може призначити додаткові аналізи, тому не зовлікайте з зверненням до нього. Уникайте переохолодження та контакту з хворими людьми, оскільки організм більш вразливий до інфекцій. Хронічний стрес пригнічує роботу імунної системи. Включіть у повсякденне життя техніки релаксації: медитацію, дихальні вправи, легкі фізичні навантаження. Деякі препарати (наприклад, антибіотики, противірусні, гормональні ліки або хіміотерапія) можуть знижувати рівень лейкоцитів. Обов’язково консультуйтеся з лікарем щодо корекції лікування."
    }
  },


  "hematocrit": {
    "children": {
      "normal": "34-40",
      "advice_increased": "Підвищений гематокрит може свідчити про зневоднення, хронічну нестачу кисню, проблеми з дихальною системою або інші стани, які потребують детальної діагностики. Лікар призначить додаткові дослідження, як-от загальний аналіз крові, біохімія, аналіз сечі чи обстеження дихальної функції. Підвищений гематокрит часто пов'язаний зі зневодненням. Забезпечте, щоб дитина вживала достатню кількість рідини протягом дня. Надмірні навантаження можуть підвищувати рівень гематокриту через посилене споживання кисню. Забезпечте дитині помірну активність, як-от прогулянки, плавання чи легкі спортивні ігри. Діти, які живуть у високогірних районах або в умовах забрудненого повітря, часто мають підвищений рівень гематокриту через хронічну нестачу кисню. Забезпечте доступ до свіжого повітря та регулярні прогулянки в парках або зелених зонах",
      "advice_decreased": "Низький рівень гематокриту може бути наслідком анемії, що виникає через дефіцит заліза, вітаміну B12, фолієвої кислоти або інших причин. Лікар призначить додаткові аналізи крові, такі як визначення рівня заліза, феритину, вітамінів B12 і фолієвої кислоти, щоб з'ясувати точну причину. Дотримуйтеся збалансованого харчування. Важливо, щоб дитина отримувала всі необхідні нутрієнти для нормального розвитку: білки, вуглеводи, жири, вітаміни та мінерали. Продукти, багаті клітковиною, такі як цільнозернові, овочі та фрукти, також важливі для загального здоров’я. Якщо дитина почувається слабкою, має часті головні болі, запаморочення або блідість шкіри, важливо звертатися до лікаря для корекції лікування. Лікар може рекомендувати повторні аналізи крові через кілька тижнів після початку лікування. У разі, якщо низький рівень гематокриту не пов’язаний з дефіцитом заліза або вітамінів, лікар може призначити додаткові обстеження для виключення інших захворювань, таких як хронічні інфекції, хвороби печінки, або захворювання крові."
    },
    "adolescent_boys": {
      "normal": "38-45",
      "advice_increased": "Підвищений рівень гематокриту може бути наслідком зневоднення, захворювань легенів, серцево-судинних захворювань або інших причин. Лікар може призначити додаткові обстеження, такі як аналізи крові, аналізи на функцію легень, серцево-судинні обстеження або ультразвукове дослідження органів. Підвищений гематокрит може бути викликаний зневодненням. Переконайтеся, що підліток п'є достатньо води протягом дня. Інтенсивні тренування чи надмірна фізична активність можуть підвищити рівень гематокриту через зростання потреби в кисні. Зменшення надмірних фізичних навантажень або перехід на більш помірні тренування може допомогти нормалізувати рівень гематокриту. Спека і перегрів можуть спричиняти втрату рідини та підвищувати рівень гематокриту. У спекотну погоду підліток повинен носити легкий одяг, уникати прямого сонячного проміння та пити більше рідини.",
      "advice_decreased": "Низький рівень гематокриту може бути наслідком анемії, що виникає через дефіцит заліза, вітаміну B12, фолієвої кислоти або інші захворювання. Лікар може призначити додаткові обстеження, такі як аналізи на рівень заліза, феритину, вітамінів B12 і фолієвої кислоти, а також інші дослідження для виключення серйозних захворювань. Однією з найбільш поширених причин низького рівня гематокриту є дефіцит заліза. Для нормалізації рівня гематокриту важливо вживати продукти, багаті залізом (червоне м'ясо (особливо яловичина, печінка), птах, риба, яйця, бобові (чечевиця, квасоля, нут), гречка, шпинат, горіхи). Вітамін C покращує засвоєння заліза з рослинних джерел, тому варто поєднувати продукти, багаті залізом, з фруктами та овочами, багатими вітаміном C, такими як цитрусові, червоний перець, ківі, броколі. У разі вираженого дефіциту заліза лікар може призначити залізовмісні добавки (сиропи або таблетки). Важливо приймати їх згідно з рекомендаціями лікаря, оскільки надмірне споживання заліза може бути небезпечним. Регулярний моніторинг рівня гематокриту допоможе підтримати нормальне здоров'я."
    },
    "adolescent_girls": {
      "normal": "36-44",
      "advice_increased": "Підвищений рівень гематокриту. У підлітковому віці у дівчат спостерігається інтенсивний гормональний розвиток, зокрема зміни в рівні естрогенів, що можуть впливати на кількість червоних кров'яних тілець. Тому підвищений рівень гематокриту може бути пов'язаний з такими змінами, а також з менструальним циклом. Важливо звертати увагу на симптоми, такі як сильна менструація, яка може спричинити зниження рівня заліза і, відповідно, коригувати підвищений рівень гематокриту. Якщо підвищений рівень гематокриту пов'язаний з менструальними розладами (наприклад, надмірними менструаціями), лікар може порадити консультацію з гінекологом для оцінки менструального циклу та можливих порушень, таких як гіпоменорея або меноррагія, що можуть впливати на кровообіг та рівень гематокриту. Дівчата під час підліткового віку схильні до порушень обміну кальцію через гормональні коливання, що може впливати на загальний стан здоров'я. Для підтримки нормальної роботи кісток важливо забезпечити достатнє споживання кальцію та вітаміну D, щоб підтримувати здоров'я та запобігти можливим наслідкам високого гематокриту. Стрес та емоційна напруга можуть також впливати на рівень гематокриту у дівчат через активацію стресових гормонів, які можуть підвищувати кількість еритроцитів. Тому варто навчити підлітка ефективним методам управління стресом, таким як медитація, йога або інші релаксаційні техніки.",
      "advice_decreased": "Знижений рівень гематокриту може свідчити про анемію, що може виникнути через надмірні менструації. Надмірна втрата крові під час менструацій може призвести до зниження рівня червоних кров'яних тілець і, як наслідок, до зниження гематокриту. У таких випадках лікар може порекомендувати консультацію з гінекологом для контролю менструального циклу і вирішення можливих порушень, таких як гіпоменорея або меноррагія. Оскільки анемія через дефіцит заліза є однією з основних причин низького рівня гематокриту у дівчат, важливо вживати продукти, багаті залізом. Це включає червоне м'ясо, рибу, бобові, шпинат і зелень. У разі вираженого дефіциту заліза лікар може призначити залізовмісні добавки. Гормональні зміни можуть також впливати на рівень гематокриту у дівчат, тому важливо підтримувати здоров'я кісток за допомогою достатнього споживання кальцію та вітаміну D, що сприяє правильному обміну кальцію та нормалізації гормональної функції. Підлітки з низьким рівнем гематокриту повинні регулярно здавати аналізи крові, щоб відслідковувати зміни в рівні червоних кров'яних тілець і своєчасно коригувати лікування."
    },
    "adults": {
      "normal": "38-52",
      "advice_increased": "Високий рівень гематокриту може бути ознакою різних станів, таких як деякі захворювання легенів (наприклад, хронічний обструктивний бронхіт), порушення функції серця, або деякі хронічні захворювання. Лікар може призначити додаткові аналізи для виявлення основної причини підвищення рівня гематокриту, зокрема обстеження на захворювання серцево-судинної системи чи легенів. Пацієнтам з підвищеним рівнем гематокриту важливо регулярно здавати аналізи крові для відстеження змін в цьому показнику, оскільки надмірно високий рівень гематокриту може призвести до згущення крові і підвищення ризику утворення тромбів. Високий рівень гематокриту може бути пов'язаний з дегідратацією (нехватка рідини в організмі), тому важливо підтримувати нормальний рівень рідини в організмі, вживаючи достатню кількість води. Це допоможе зменшити в'язкість крові і знизити ризик тромбоутворення. Збалансоване харчування важливе для підтримки нормального рівня гематокриту. У раціон слід включати продукти, багаті на залізо (червоне м'ясо, риба, зелені листові овочі) і вітаміни групи B. Якщо високий рівень гематокриту пов'язаний із захворюваннями крові або іншими серйозними станами, лікар може рекомендувати зміни в харчуванні або призначити відповідні добавки. Стрес може підвищити рівень гематокриту через активацію стресових гормонів, які можуть збільшити кількість червоних кров'яних тілець. Рекомендується застосовувати методи релаксації, такі як йога, медитація або дихальні вправи для зниження стресу.",
      "advice_decreased": "Гематокрит знаходиться на низькому рівні. Загальні рекомендації зосереджені на корекції харчування, способу життя і медичному спостереженні. Одна з основних причин низького рівня гематокриту — анемія через дефіцит заліза. Лікар може порекомендувати збільшити споживання продуктів, багатих на залізо, таких як червоне м'ясо, печінка, бобові, шпинат, броколі, насіння та горіхи. Також корисні продукти, що містять вітамін C, який покращує засвоєння заліза (цитрусові, ягоди, перець). Якщо причиною низького рівня гематокриту є порушення всмоктування заліза в кишечнику (наприклад, через целіакію або хронічні захворювання шлунково-кишкового тракту), лікар може рекомендувати лікування основних захворювань та вживання добавок заліза в іншій формі. У разі низького рівня гематокриту важливо уникати факторів, які можуть погіршити ситуацію, таких як надмірне вживання алкоголю або куріння, оскільки ці фактори можуть знижувати рівень червоних кров'яних тілець. Якщо низький рівень гематокриту супроводжується симптомами, такими як слабкість, запаморочення, часті інфекції, лікар може порекомендувати додаткові дослідження для виявлення потенційних порушень в роботі імунної системи або інших важливих органів."
    }
  },



  "erythrocytes": {
    "children": {
      "normal": "4.0-5.5",
      "advice_increased": "Дитина має підвищений рівень еритроцитів у дитини може бути наслідком різних причин, таких як деякі захворювання серцево-судинної системи, вроджені порушення, деякі інфекційні захворювання. Лікар проведе необхідні обстеження, щоб визначити основну причину підвищення рівня еритроцитів. Іноді підвищений рівень еритроцитів може бути результатом надмірного вживання стимуляторів, таких як біологічно активні добавки або ліки, що стимулюють вироблення еритроцитів. Лікар може порадити переглянути застосовувані ліки чи добавки. Оскільки підвищений рівень еритроцитів може бути пов'язаний з іншими захворюваннями, важливо регулярно відвідувати педіатра для загального огляду, щоб своєчасно виявити будь-які відхилення та вжити необхідних заходів.",
      "advice_decreased": "Ваші покази вказують на знижений рівнь еритроцитів у дитини, рекомендуємо звернутися до лікаря, що порадить провести додаткові обстеження, щоб визначити точну причину низького рівня еритроцитів у дитини. Це може бути анемія, пов’язана з дефіцитом заліза, вітамінів (B12 або фолієвої кислоти), або хронічні захворювання, які можуть впливати на кровотворення."
    },
    "adolescent_boys": {
      "normal": "4.5-5.5",
      "advice_increased": "У вас  підвищений рівень еритроцитів. Потрібно звернутися до лікаря для повного обстеження та встановлення точної причини еритроцитозу. Лікар призначить необхідні аналізи (загальний аналіз крові, біохімічний аналіз крові, можливо, інші дослідження) та, за потреби, направить до вузьких спеціалістів (гематолога, кардіолога, пульмонолога). Проконсультуватися з лікарем.",
      "advice_decreased": "У вас знижений рівень еритроцитів важливо звернутися до лікаря, щоб з’ясувати причину низького рівня еритроцитів. "
    },
    "adolescent_girls": {
      "normal": "4.0-5.0",
      "advice_increased": "Підвищений рівень еритроцитів. Рекомендується обстеження у лікаря для встановлення точної причини еритроцитозу. Лікар призначить необхідні аналізи (загальний аналіз крові, біохімічний аналіз крові, можливо, інші дослідження) та, за потреби, направить до вузьких спеціалістів (гематолога, кардіолога, пульмонолога). Проконсультуватися з лікарем.",
      "advice_decreased": "Знижений рівень еритроцитів. Важливо пройти обстеження у лікаря для встановлення точного діагнозу і вжити необхідних заходів, включаючи корекцію харчування, прийом добавок, а також регулярний моніторинг стану здоров'я."
    },
    "adults": {
      "normal": "4.0-5.6",
      "advice_increased": "Підвищений рівень еритроцитів. Найперше та найважливіше – звернутися до лікаря для встановлення точної причини еритроцитозу та отримання індивідуального плану лікування. Пам'ятайте, що самолікування може бути небезпечним. Тільки кваліфікований лікар може поставити точний діагноз та призначити адекватне лікування. Своєчасне звернення за медичною допомогою допоможе запобігти серйозним ускладненням.",
      "advice_decreased": "Знижений рівень еритроцитів. Для встановлення точної причини анемії та призначення відповідного лікування необхідно звернутися до лікаря. Пам'ятайте, що самолікування може бути небезпечним. Тільки кваліфікований лікар може поставити точний діагноз та призначити адекватне лікування. Своєчасне звернення за медичною допомогою допоможе запобігти серйозним ускладненням."
    }
  }
}
